src/cf/Enums/вогТипыПолейКонтрагента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>вогТипыПолейКонтрагента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаименованиеПолное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CRM_ИНН</Name>
					<Comment>//++LVN 17.10.2013 ИТ-1576</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CRM_КПП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮридическийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФактическийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/вогТипыПолейКонтрагента/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ОпределитьТипПоляКонтактнойИнформации(ВидКИ) Экспорт
	
	ТипПоля = Неопределено;
	
	Если ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонЮридическогоЛица
		Или ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонТорговойТочки
		Или ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонРаспределительногоЦентра Тогда
		
		ТипПоля = Перечисления.вогТипыПолейКонтрагента.Телефон;
		
	ИначеЕсли ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресЮридическогоЛица
		Или ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресТорговойТочки 
		Или ВидКИ = Справочники.ВидыКонтактнойИнформации.АдресРаспределительногоЦентра Тогда
		
		ТипПоля = Перечисления.вогТипыПолейКонтрагента.ФактическийАдрес;
		
	ИначеЕсли ВидКИ = Справочники.ВидыКонтактнойИнформации.ЮрАдресЮридическогоЛица 
		Или ВидКИ = Справочники.ВидыКонтактнойИнформации.ЮрАдресТорговойТочки 
		Или ВидКИ = Справочники.ВидыКонтактнойИнформации.ЮрАдресРаспределительногоЦентра Тогда
		
		ТипПоля = Перечисления.вогТипыПолейКонтрагента.ЮридическийАдрес;
		
	КонецЕсли;
	
	Возврат ТипПоля;
	
КонецФункции

#КонецОбласти

#КонецЕсли
